cmsis-svd/cmsis-svd/data/Nuvoton/NUC100_Series.xml
       <register>
          <name>PORCR</name>
          <description>Power-On-Reset Controller Register</description>
          <addressOffset>0x00000024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffff00</resetMask>
          <fields>
            <field>
              <name>POR_DIS_CODE</name>
              <description>The register is used for the Power-On-Reset enable control
When power on, the POR circuit generates a reset signal to reset the whole chip function, but noise on the power may cause the POR active again. User can disable internal POR circuit to avoid unpredictable noise to cause chip reset by writing 0x5AA5 to this field.
The POR function will be active again when this field is set to another value or chip is reset by other reset source, including: /RESET, Watch dog, LVR reset, BOD reset, ICE reset command and the software-chip reset function
This bit is the protected bit. It means programming this needs to write &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to address 0x5000_0100 to disable register protection. Reference the register REGWRPROT at address GCR_BA+0x100.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>GPA_MFP</name>
          <description>GPIOA multiple function and input type control register</description>
          <addressOffset>0x00000030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>GPA_MFP0</name>
              <description>PA.0 Pin Function Selection
1 = The ADC0 (Analog-to-Digital converter channel 0) function is selected to the pin PA.0
0 = The GPIOA[0] is selected to the pin PA.0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP1</name>
              <description>PA.1 Pin Function Selection
The pin function depends on GPA_MFP1 and EBI_HB_EN[4] (ALT_MFP[20]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[4]	EBI_EN 	GPA_MFP[1]	PA.1 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	ADC1 (ADC)	
0 	1 	1 	ADC1 (ADC)	
1 	1 	1 	AD12 (EBI AD bus bit 12)	</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP2</name>
              <description>PA.2 Pin Function Selection
The pin function depends on GPA_MFP2 and EBI_HB_EN[3] (ALT_MFP[19]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[3]	EBI_EN 	GPA_MFP[2]	PA.2 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	ADC2 (ADC)	
0 	1 	1 	ADC2 (ADC)	
1 	1 	1 	AD11 (EBI AD bus bit 11)	</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP3</name>
              <description>PA.3 Pin Function Selection
The pin function depends on GPA_MFP3 and EBI_HB_EN[2] (ALT_MFP[18]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[2]	EBI_EN 	GPA_MFP[3]	PA.3 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	ADC3 (ADC)	
0 	1 	1 	ADC3 (ADC)	
1 	1 	1 	AD10 (EBI AD bus bit 10)	</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP4</name>
              <description>PA.4 Pin Function Selection
The pin function depends on GPA_MFP4 and EBI_HB_EN[1] (ALT_MFP[17]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[1]	EBI_EN 	GPA_MFP[4]	PA.4 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	ADC4 (ADC)	
0 	1 	1 	ADC4 (ADC)	
1 	1 	1 	AD9 (EBI AD bus bit 9)	</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP5</name>
              <description>PA.5 Pin Function Selection
The pin function depends on GPA_MFP5 and EBI_HB_EN[0] (ALT_MFP[16]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[0]	EBI_EN 	GPA_MFP[5]	PA.5 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	ADC5 (ADC)	
0 	1 	1 	ADC5 (ADC)	
1 	1 	1 	AD8 (EBI AD bus bit 8)	</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP6</name>
              <description>PA.6 Pin Function Selection
The pin function depends on GPA_MFP6 and EBI_EN (ALT_MFP[11]).
EBI_EN 	GPA_MFP[6]	PA.6 function 	
x 	0 	GPIO 	
0 	1 	ADC6 (ADC)	
1 	1 	AD7 (EBI AD bus bit 7)	</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP7</name>
              <description>PA.7 Pin Function Selection
The pin function depends on GPA_MFP7 and PA7_S21 (ALT_MFP[2]) and EBI_EN (ALT_MFP[11]).
EBI_EN	PA7_S21	GPA_MFP[7]	PA.7 function 	
x 	x 	0 	GPIO 	
0 	0 	1 	ADC7 (ADC)	
0 	1 	1 	SPISS21 (SPI2)	
1 	x 	1 	AD6 (EBI AD bus bit 6)	</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP8</name>
              <description>PA.8 Pin Function Selection
1 = The I2C0 SDA function is selected to the pin PA.8
0 = The GPIOA[8] is selected to the pin PA.8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP9</name>
              <description>PA.9 Pin Function Selection
1 = The I2C0 SCL function is selected to the pin PA.9
0 = The GPIOA[9] is selected to the pin PA.9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP10</name>
              <description>PA.10 Pin Function Selection
The pin function depends on GPA_MFP10 and EBI_EN (ALT_MFP[11]).
EBI_EN 	GPA_MFP[10]	PA.10 function 	
x 	0 	GPIO 	
0 	1 	SDA1 (I2C)	
1 	1 	nWR (EBI)	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP11</name>
              <description>PA.11 Pin Function Selection
The pin function depends on GPA_MFP11 and EBI_EN (ALT_MFP[11]).
EBI_EN 	GPA_MFP[11]	PA.11 function 	
x 	0 	GPIO 	
0 	1 	SCL1 (I2C)	
1 	1 	nRD (EBI)	</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP12</name>
              <description>PA.12 Pin Function Selection
The pin function depends on GPA_MFP12 and EBI_HB_EN[5] (ALT_MFP[21]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[5]	EBI_EN 	GPA_MFP[12]	PA.12 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	PWM0 (PWM)	
0 	1 	1 	PWM0 (PWM)	
1 	1 	1 	AD13 (EBI AD bus bit 13)	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP13</name>
              <description>PA.13 Pin Function Selection
The pin function depends on GPA_MFP13 and EBI_HB_EN[6] (ALT_MFP[22]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[6]	EBI_EN 	GPA_MFP[13]	PA.13 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	PWM1 (PWM)	
0 	1 	1 	PWM1 (PWM)	
1 	1 	1 	AD14 (EBI AD bus bit 14)	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP14</name>
              <description>PA.14 Pin Function Selection
The pin function depends on GPA_MFP14 and EBI_HB_EN[7] (ALT_MFP[23]) and EBI_EN (ALT_MFP[11]).
EBI_HB_EN[7]	EBI_EN 	GPA_MFP[14]	PA.14 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	PWM2 (PWM)	
0 	1 	1 	PWM2 (PWM)	
1 	1 	1 	AD15 (EBI AD bus bit 15)	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_MFP15</name>
              <description>PA.14 Pin Function Selection
The pin function depends on GPA_MFP15 and PA15_I2SMCLK (ALT_MFP[9]).
PA15_I2SMCLK	GPA_MFP[15]	PA.15 function 	
x 	0 	GPIO 	
0 	1 	PWM3 (PWM) 	
1 	1 	I2SMCLK (I2S)	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPA_TYPEn</name>
              <description>1 = Enable GPIOA[15:0] I/O input Schmitt Trigger function
0 = Disable GPIOA[15:0] I/O input Schmitt Trigger function</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
