cmsis-svd/cmsis-svd/data/Nuvoton/NUC100_Series.xml
       <register>
          <name>GPC_MFP</name>
          <description>GPIOC multiple function and input type control register</description>
          <addressOffset>0x00000038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>SPI0_SS0_I2SLRCLK</name>
              <description>PC.0 Pin Function Selection
Bits PC0_I2SLRCLK (ALT_MFP[5]) and GPC_MFP[0] determine the PC.0 function.
PC0_I2SLRCLK	GPC_MFP[0]	PC.0 function 	
x 	0 	GPIO 	
0 	1 	SPISS00(SPI0) 	
1 	1 	I2SLRCLK (I2S)	</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI0_CLK_I2SBCLK</name>
              <description>PC.1 Pin Function Selection
Bits PC1_I2SBCLK (ALT_MFP[6]) and GPC_MFP[1] determine the PC.1 function.
PC1_I2SBCLK	GPC_MFP[1]	PC.1 function 	
x 	0 	GPIO 	
0 	1 	SPICLK0 (SPI0) 	
1 	1 	I2SBLK (I2S)	</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI0_MISO0_I2SDI</name>
              <description>PC.2 Pin Function Selection
Bits PC2_I2SDI (ALT_MFP[7]) and GPC_MFP[2] determine the PC.2 function.
PC2_I2SDI	GPC_MFP[2]	PC.2 function 	
x 	0 	GPIO 	
0 	1 	MISO00 (SPI0) 	
1 	1 	I2SDI (I2S)	</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI0_MOSI0_I2SDO</name>
              <description>PC.3 Pin Function Selection
Bits PC3_I2SDO (ALT_MFP[8]) and GPC_MFP[3] determine the PC.3 function.
PC3_I2SDO	GPC_MFP[3]	PC.3 function 	
x 	0 	GPIO 	
0 	1 	MOSI00 (SPI0) 	
1 	1 	I2SDO (I2S)	</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI0_MISO1</name>
              <description>PC.4 Pin Function Selection
1 = The SPI0 MISO1 (master input, slave output pin-1) function is selected to the pin PC.4
0 = The GPIOC[4] is selected to the pin PC.4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI0_MOSI1</name>
              <description>PC.5 Pin Function Selection
1 = The SPI0 MOSI1 (master output, slave input pin-1) function is selected to the pin PC.5
0 = The GPIOC[5] is selected to the pin PC.5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CPP0_AD4</name>
              <description>PC.6 Pin Function Selection
The pin function depends on GPC_MFP6 and EBI_EN (ALT_MFP[11]).
EBI_EN	GPC_MFP[6]	PC.6 function 	
x 	0 	GPIO 	
0 	1 	CPP0 (CMP) 	
1 	1 	AD4 (EBI AD bus bit 4)	</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CPN0_AD5</name>
              <description>PC.7 Pin Function Selection
The pin function depends on GPC_MFP7 and EBI_EN (ALT_MFP[11]).
EBI_EN	GPC_MFP[7]	PC.7 function 	
x 	0 	GPIO 	
0 	1 	CPN0 (CMP) 	
1 	1 	AD5 (EBI AD bus bit 5)	</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI1_SS0_MCLK</name>
              <description>PC.8 Pin Function Selection
The pin function depends on GPC_MFP8 and EBI_MCLK_EN (ALT_MFP[12]) and EBI_EN (ALT_MFP[11]).
EBI_MCLK_EN 	EBI_EN 	GPC_MFP[8]	PC.8 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	SPISS10 (SPI1) 	
0 	1 	1 	SPISS10 (SPI1) 	
1 	1 	1 	MCLK (EBI Clock output)	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI1_CLK</name>
              <description>PC.9 Pin Function Selection
1 = The SPI1 SPICLK function is selected to the pin PC.9
0 = The GPIOC[9] is selected to the pin PC.9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI1_MISO0</name>
              <description>PC.10 Pin Function Selection
1 = The SPI1 MISO0 (master input, slave output pin-0) function is selected to the pin PC.10
0 = The GPIOC[10] is selected to the pin PC.10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI1_MOSI0</name>
              <description>PC.11 Pin Function Selection
1 = The SPI1 MOSI0 (master output, slave input pin-0) function is selected to the pin PC.11
0 = The GPIOC[11] is selected to the pin PC.11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI1_MISO1</name>
              <description>PC.12 Pin Function Selection
1 = The SPI1 MISO1 (master input, slave output pin-1) function is selected to the pin PC.12
0 = The GPIOC[12] is selected to the pin PC.12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SPI1_MOSI1</name>
              <description>PC.13 Pin Function Selection
1 = The SPI1 MOSI1 (master output, slave input pin-1) function is selected to the pin PC.13
0 = The GPIOC[13] is selected to the pin PC.13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CPP1_AD2</name>
              <description>PC.14 Pin Function Selection
The pin function depends on GPC_MFP14 and EBI_EN (ALT_MFP[11]).
EBI_EN 	GPC_MFP[14]	PC.14 function 	
x 	0 	GPIO 	
0 	1 	CPP1 (CMP)	
1 	1 	AD2 (EBI AD bus bit 2)	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CPP1_AD3</name>
              <description>PC.15 Pin Function Selection
The pin function depends on GPC_MFP15 and EBI_EN (ALT_MFP[11]).
EBI_EN 	GPC_MFP[15]	PC.15 function 	
x 	0 	GPIO 	
0 	1 	CPN1 (CMP)	
1 	1 	AD3 (EBI AD bus bit 3)	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SCHMITT</name>
              <description>1 = Enable GPIOC[15:0] I/O input Schmitt Trigger function
0 = Disable GPIOC[15:0] I/O input Schmitt Trigger function</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
