cmsis-svd/cmsis-svd/data/Nuvoton/NUC100_Series.xml
       <register>
          <name>ALT_MFP</name>
          <description>Alternative Multiple Function Pin Control Register</description>
          <addressOffset>0x00000050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>PB10_S01</name>
              <description>Bits PB10_S01 and GPB_MFP10 determine the PB.10 function.
PB10_S01	GPB_MFP[10]	PB.10 function 	
x 	0 	GPIO 	
0 	1 	TM2 	
1 	1 	SPISS01 (SPI0)	</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PB9_S11</name>
              <description>Bits PB9_S11 and GPB_MFP9 determine the PB.9 function.
PB9_S11	GPB_MFP[9]	PB.9 function 	
x 	0 	GPIO 	
0 	1 	TM1 	
1 	1 	SPISS11 (SPI1)	</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PA7_S21</name>
              <description>Bits PA7_S21, PA_MFP7 and EBI_EN (ALT_MFP[11])determine the PA.7 function.
EBI_EN	PA7_S21	GPA_MFP[7]	PA.7 function 	
x 	x 	0 	GPIO 	
0 	0 	1 	ADC7 (ADC)	
0 	1 	1 	SPISS21 (SPI2)	
1 	x 	1 	AD6 (EBI AD bus bit 6)	</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PB14_S31</name>
              <description>Bits PB14_S31 and GPB_MFP14 determine the GPB14 function.
PB14_S31	GPB_MFP[14]	PB.14 function 	
x 	0 	GPIO 	
0 	1 	/INT0 	
1 	1 	SPISS31 (SPI3)	</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PB11_PWM4</name>
              <description>Bits PB11_PWM4 and GPB_MFP[11] determine the PB.11 function.
PB11_PWM4	GPB_MFP[11]	PB.11 function 	
x 	0 	GPIO 	
0 	1 	TM3 	
1 	1 	PWM4 (PWM)	</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PC0_I2SLRCLK</name>
              <description>Bits PC0_I2SLRCLK and GPC_MFP[0] determine the PC.0 function.
PC0_I2SLRCLK	GPC_MFP[0]	PC.0 function 	
x 	0 	GPIO 	
0 	1 	SPISS00(SPI0) 	
1 	1 	I2SLRCLK (I2S)	</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PC1_I2SBCLK</name>
              <description>Bits PC1_I2SBCLK and GPC_MFP[1] determine the PC.1 function.
PC1_I2SBCLK	GPC_MFP[1]	PC.1 function 	
x 	0 	GPIO 	
0 	1 	SPICLK0 (SPI0) 	
1 	1 	I2SBLK (I2S)	</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PC2_I2SDI</name>
              <description>Bits PC2_I2SDI and GPC_MFP[2] determine the PC.2 function.
PC2_I2SDI	GPC_MFP[2]	PC.2 function 	
x 	0 	GPIO 	
0 	1 	MISO00 (SPI0) 	
1 	1 	I2SDI (I2S)	</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PC3_I2SDO</name>
              <description>Bits PC3_I2SDO and GPC_MFP[3] determine the PC.3 function.
PC3_I2SDO	GPC_MFP[3]	PC.3 function 	
x 	0 	GPIO 	
0 	1 	MOSI00 (SPI0) 	
1 	1 	I2SDO (I2S)	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PA15_I2SMCLK</name>
              <description>Bits PA15_I2SMCLK and GPA_MFP[15] determine the PA.15 function.
PA15_I2SMCLK	GPA_MFP[15]	PA.15 function 	
x 	0 	GPIO 	
0 	1 	PWM3 (PWM) 	
1 	1 	I2SMCLK (I2S)	</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PB12_CLKO</name>
              <description>Bits PB12_CLKO and GPB_MFP[12] determine the PB.12 function.
EBI_EN 	PB12_CLKO 	GPB_MFP[12]	PB.12 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	CPO0 (CMP)	
0 	1 	1 	CLKO (Clock Driver output)	
1 	1 	1 	AD0 (EBI AD bus bit 0)	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>EBI_EN</name>
              <description>EBI_EN is use to switch GPIO function to EBI function (AD[15:0], ALE, RE, WE, CS, MCLK), it need additional registers EBI_EN[7:0] and EBI_MCLK_EN for some GPIO to switch to EBI function(AD[15:8], MCLK)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>EBI_MCLK_EN</name>
              <description>Bits EBI_MCLK_EN, EBI_EN and GPC_MFP[8] determine the PC.8 function.
EBI_MCLK_EN 	EBI_EN 	GPC_MFP[8]	PC.8 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	SPISS10 (SPI1) 	
0 	1 	1 	SPISS10 (SPI1) 	
1 	1 	1 	MCLK (EBI Clock output)	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>EBI_nWRL_EN</name>
              <description>Bits EBI_nWRL_EN, EBI_EN and GPB_MFP[2] determine the PB.2 function.
EBI_nWRL_EN 	EBI_EN 	GPB_MFP[2]	PB.2 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	RTS0 (UART0)	
0 	1 	1 	RTS0 (UART0)	
1 	1 	1 	nWRL (EBI write low byte enable)	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>EBI_nWRH_EN</name>
              <description>Bits EBI_nWRH_EN, EBI_EN and GPB_MFP[3] determine the PB.3 function
EBI_nWRH_EN 	EBI_EN 	GPB_MFP[3]	PB.3 function 	
x 	x 	0 	GPIO 	
x 	0 	1 	CTS0 (UART0)	
0 	1 	1 	CTS0 (UART0)	
1 	1 	1 	nWRH (EBI write high byte enable)	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>EBI_HB_EN</name>
              <description>EBI_HB_EN is use to switch GPIO function to EBI address/data bus high byte (AD[15:8]), EBI_HB_EN, EBI_EN and corresponding GPx_MFP[y] determine the Px.y function.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>REGWRPROT</name>
          <description>Register Write Protect Register</description>
          <addressOffset>0x00000100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>REGPROTDIS</name>
              <description>Register Write Protection Disable Index (Read only)
1 = Write-Protection is disabled for writing protected registers
0 = Write-Protection is enabled for writing protected registers. Any write to the protected register is ignored.
The Protected registers are:
IPRST1: address 0x5000_0008
BODCR: address 0x5000_0018
PORCR: address 0x5000_0024
PWRCON: address 0x5000_0200 (bit[6] is not protected for power wake-up interrupt clear)
APBCLK bit[0]: address 0x5000_0208 (bit[0] is watchdog timer clock enable)
CLK_SEL0: address 0x5000_0210 (for HCLK and CPU STCLK clock source select)
CLK_SEL1 bit[1:0]: address 0x5000_0214 (for watch dog clock source select)
ISPCON: address 0x5000_C000 (Flash ISP Control register)
WTCR: address 0x4000_4000
FATCON: address 0x5000_C018</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>REGWRPROT</name>
              <description>Register Write-Protection Code (Write only)
Some write-protected registers have to be disabled the protected function by writing the sequence value &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to this field. After this sequence is completed, the REGPROTDIS bit will be set to 1 and write-protected registers can be normal write.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
