cmsis-svd/cmsis-svd/data/Nuvoton/NUC100_Series.xml
       <register>
          <name>IEN</name>
          <description>GPIO Port Interrupt Enable</description>
          <addressOffset>0x0000001c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>IF_EN0</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN1</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN2</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN3</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN4</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN5</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN6</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN7</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN8</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN9</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN10</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN11</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN12</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN13</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN14</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN15</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IF_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the PIN[n] state low-level or high-to-low change interrupt 
0 = Disable the PIN[n] state low-level or high-to-low change interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN0</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IR_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the PIN[n] level-high or low-to-high interrupt 
0 = Disable the PIN[n] level-high or low-to-high interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN1</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IR_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the PIN[n] level-high or low-to-high interrupt 
0 = Disable the PIN[n] level-high or low-to-high interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN2</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IR_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the PIN[n] level-high or low-to-high interrupt 
0 = Disable the PIN[n] level-high or low-to-high interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN3</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IR_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the PIN[n] level-high or low-to-high interrupt 
0 = Disable the PIN[n] level-high or low-to-high interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN4</name>
              <description>Port [A/B/C/D/E] Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[n] used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit to 1 also enable the pin wakeup function
When set the IR_EN[n] bit to 1:
If the interrupt is level trigger, the input PIN[n] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge trigger, the input PIN[n] state change from &quot;low-to-high&quot; will generate the interrupt.
