cmsis-svd/cmsis-svd/data/Nuvoton/NUC100_Series.xml
       <register>
          <name>UA_BAUD</name>
          <description>Baud Rate Divisor Register</description>
          <addressOffset>0x00000024</addressOffset>
          <access>read-write</access>
          <resetValue>0x0f000000</resetValue>
          <resetMask>0xf0ffffff</resetMask>
          <fields>
            <field>
              <name>BRD</name>
              <description>Baud Rate Divider 
The field indicated the baud rate divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DIVIDER_X</name>
              <description>Divider X
The baud rate divider M = X+1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DIV_X_ONE</name>
              <description>Divider X equal 1
0 = Divider M = X (the equation of M = X+1, but Divider_X[27:24] must &gt; =8)
1 = Divider M = 1 (the equation of M = 1, but BRD[15:0] must &gt;=3).
Mode	DIV_X_EN 	DIV_X_ONE 	DIVIDER X 	BRD 	Baud rate equation 	
0 	Disable 	0 	B	A	UART_CLK / [16 * (A+2)]	
1 	Enable 	0 	B	A	UART_CLK/[(B+1)*(A+2)],B must &gt;= 8	
2 	Enable 	1	Don't Care	A	UART_CLK / (A+2), A must &gt;=3	</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DIV_X_EN</name>
              <description>Divider X Enable
The BRD = Baud Rate Divider, and the baud rate equation is 
Baud Rate = Clock / [ M * (BRD + 2) ] ; The default value of M is 16.
0 = Disable divider X (the equation of M = 16)
1 = Enable divider X (the equation of M = X+1, but Divider_X[27:24 must &gt; =8).
NOTE: When in IrDA mode, this bit must disable.
Mode	DIV_X_EN 	DIV_X_ONE 	DIVIDER X 	BRD 	Baud rate equation 	
0 	Disable 	0 	B	A	UART_CLK / [16 * (A+2)]	
1 	Enable 	0 	B	A	UART_CLK/[(B+1)*(A+2)],B must &gt;= 8	
2 	Enable 	1	Don't Care	A	UART_CLK / (A+2), A must &gt;=3	</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>UA_IRCR</name>
          <description>IrDA Control Register.</description>
          <addressOffset>0x00000028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0xffffffbf</resetMask>
          <fields>
            <field>
              <name>TX_SELECT</name>
              <description>Enable IrDA Receiver
1: Enable IrDA transmitter
0: Enable IrDA receiver</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>INV_TX</name>
              <description>INV_TX
1= Inverse TX output signal
0= No inversion</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>INV_RX</name>
              <description>INV_RX
1= Inverse RX input signal
0= No inversion</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>zeroToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>UA_ALT_CSR</name>
          <description>LIN Break Failed Count Register.</description>
          <addressOffset>0x0000002c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>UA_LIN_BKFL</name>
              <description>UART LIN Break Field Length
This field indicates a 4-bit LIN TX break field count.
NOTE: This break field length is UA_LIN_BKFL + 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>LIN_RX_EN</name>
              <description>LIN RX Enable
1 = Enable LIN RX mode.
0 = Disable LIN RX mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>LIN_TX_EN</name>
              <description>LIN TX Break Mode Enable
1 = Enable LIN TX Break mode.
0 = Disable LIN TX Break mode.
NOTE: When TX break field transfer operation finish, this will be cleared automatically.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RS485_NMM</name>
              <description>RS-485 Normal Multi-drop Operation Mode (NMM) (Low Density Only)
1 = Enable RS-485 Normal Multi-drop Operation Mode (NMM).
0 = Disable RS-485 Normal Multi-drop Operation Mode (NMM).
Note: It can't be active with RS485_AAD operation mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RS485_AAD</name>
              <description>RS-485 Auto Address Detection Operation Mode (AAD) (Low Density Only)
1 = Enable RS-485 Auto Address Detection Operation Mode (AAD).
0 = Disable RS-485 Auto Address Detection Operation Mode (AAD).
Note: It can't be active with RS485_NMM operation mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RS485_AUD</name>
              <description>RS-485 Auto Direction Mode (AUD) (Low Density Only)
1 = Enable RS-485 Auto Direction Operation Mode (AUO).
0 = Disable RS-485 Auto Direction Operation Mode (AUO).
Note:This field is used for RS-485 any operation mode.
Note: It can be active with RS-485_AAD or RS485_NMM operation mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RS485_ADD_EN</name>
              <description>RS-485 Address Detection Enable (Low Density Only)
1 = Enable address detection mode.
0 = Disable address detection mode.
Note: This field is used for RS485 any operation mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ADDR_MATCH</name>
              <description>Address match value register (Low Density Only)
This field contains the RS-485 address match values.
Note: This field is used for RS-485 auto address detection mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>UA_FUN_SEL</name>
          <description>Function Select Register.</description>
          <addressOffset>0x00000030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>FUN_SEL</name>
              <description>Function Select Enable
00 = UART Function
01 = Enable LIN Function
10 = Enable IrDA Function
11 = Enable RS-485 Function (Low Density Only)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
